package com.example.read;

import android.app.Activity;
import android.os.Bundle;
import android.util.Log;

public class BaseActivity extends Activity{
    public String str;
//    public String [] mystr=new String[5];
	@Override
	protected void onCreate(Bundle savedInstanceState) {
		// TODO Auto-generated method stub
		super.onCreate(savedInstanceState);
		
	}
    public void setstr(){
//    	str='这个世界，多一份喧嚣\r\n，就少一份宁静，多一段痴想，就少一份率真。';
//    	mystr[0]='     这个世界，多一份喧嚣，就少一份宁静，多一段痴想，就少一份率真。\n';
//    	mystr[1]='是生怕天气会变得狂热，所以就有了夜雨吧。\n';
//    	mystr[2]='为躁动添一种和谐，不让这一季显得枯燥，这是雨的本意，';
//    	mystr[3]='也是季节的恩惠。\n从雨滴落过的地方找寻，会发现斑斑点点的痕迹，痕迹多了，\n';
//    	mystr[4]='就凸出新意了。油纸伞，\n因出现在雨巷，故而痴想。叶儿，\n';
    	
//    	str='<div class='copyright'><h2><font size='5'>版权信息</font></h2><p>书名：茶叶战争——茶叶与天朝的兴衰</p><p>作者：周重林 太俊林</p><p>出版社：华中科技大学出版社</p><p>ISBN：978-7-5609-8243-4</p><p>版权所有，侵权必究。</p></div><div class='copyright'><h2><font size='5'>版权信息</font></h2><p>书名：茶叶战争——茶叶与天朝的兴衰</p><p>作者：周重林 太俊林</p><p>出版社：华中科技大学出版社</p><p>ISBN：978-7-5609-8243-4</p><p>版权所有，侵权必究。</p></div><div class='copyright'><h2><font size='5'>版权信息</font></h2><p>书名：茶叶战争——茶叶与天朝的兴衰</p><p>作者：周重林 太俊林</p><p>出版社：华中科技大学出版社</p><p>ISBN：978-7-5609-8243-4</p><p>版权所有，侵权必究。</p></div>';
    	
    	str="<p><br/></p><p style='text-align: center;'><br/></p><h2 id='sigil_toc_id_1' style='text-align: center;'><font color='firebrick' face='黑体'>第一章 1840年的茶叶战争</font><img alt='zhangjietihua' src='../Images/zhangjietihua.png'/></h2><p><br/></p><p style='text-align: center;'><img alt='chapter1' src='../Images/chapter1.jpg'/><br/><font face='楷体'>中国茶叶出口时称重、品鉴，1790年，水墨</font></p><p><br/></p><p><br/></p><p><br/></p><p><br/></p><p><br/></p><p><br/></p><p><br/></p><p><br/></p><p><img alt='xiaoyin' src='../Images/xiaoyin.png'/><b><font face='楷体'>林则徐与道光皇帝</font></b></p><p class='sigil_not_in_toc'><font face='楷体'>死生命也，成败天也，苟利社稷，敢不竭股肱以为门墙辱? <span style='text-align: right;'>——林则徐</span></font></p><p class='sigil_not_in_toc' style='text-align: left;'><font face='楷体'>将萎之华，惨于槁木。 ——龚自珍</font></p><p><br/><br/></p><p>1839年1月8日(道光十九年十一月二十三日)，小寒刚过去两天，拂晓时分的北京街头，寒风刺骨。晨雾遮挡了早起者的视野，更多的北京居民还躲在被窝里。这一天将要做什么，许多人没有打算。<br/></p><p>林则徐所住的行辕前，此时已是人喧马嘶，打破了清晨的静谧。华丽的轿子和马车停在门前，即将要出行的人们分头张罗着，只待林则徐一声令下，大家就可以登车揽辔，浩浩荡荡南下奔广州而去。</p><p>前来送行的人，觉得钦差大人的排场似乎小了点。那么大群人中，有12个是轮流抬轿的脚夫，9个是厨子，没有官兵随行，前面也没有鸣锣开道的人。这也是林则徐好友龚自珍担心的，他建议林则徐不要孤身前往，应该带军南下，这样才能起到震慑的效果，达到惩奸除恶的目的。</p><p>天完全亮了后，阳光明媚，这是一个不错的晴朗天，适合远行。由于前来送行的人络绎不绝，行程一再延误，直到午饭后，林则徐一行人才焚香、发传牌，开始南下之旅。</p><p>这一年，林则徐55岁。道光皇帝一道圣旨，他成了钦差大臣。</p><p>“命湖广总督林则徐为钦差大臣，驰往广东，查办海口事件，该省水师，兼归节制。”</p><p>没有人知道接下来会发生什么，这个平凡的年份很快就要过去了。再过些日子，春节就要到来，大部分百姓关心的是如何过上好年，年关总是会检阅钱袋，在这之前更要奋力一搏。</p><p>出京门时，林则徐拉着自己座师、侍郎沈鼎甫的手，两人相视而泣。他对后者说，<abbr title='来新夏.林则徐年谱新编［M］.天津：南开大学出版社，1997：286.'>“死生命也，成败天也，苟利社稷，敢不竭股肱以为门墙辱?”</abbr></p><p>受命于国家危难之际，方显贤者之能。明知前面有万丈深渊，也要有勇气走过去，这就需要英雄气概。</p><p>林则徐的老友魏源认为，道光选择林则徐去禁烟，是因为林则徐说了一些让道光很动容的话：不禁烟，十余年后，将无可筹之饷，无可用之兵。</p><p>在从湖广总督任上被召唤进京前，林则徐也不知道进京的目的何在。自从道光登基以来，林则徐从浙江的盐运使、按察使、布政使一路青云直上，做到巡抚、总督，再到皇帝代言人。道光对他赞赏有加。在任命他为河东河道总督时，道光说：<abbr title='《清实录·宣宗成皇帝实录》卷200，道光十一年，癸丑条。'>“朕因林则徐由翰林出身，曾任御史，出应外任，已历十年，品学俱优，办事细心可靠，特畀以总河重任。”</abbr>大学士、两江总督孙玉庭把林则徐推荐给道光的时候评价说：<abbr title='《清实录·宣宗成皇帝实录》卷72，道光四年，壬戌条。'>“惟江苏臬司林则徐，器识远大、处事精详，任杭嘉湖道及淮海道。浙西地方，均";
    	
//    	str='     这个世界，多一份喧嚣，就少一份宁静，多一段痴想，就少一份率真。\n' +
//    			'是生怕天气会变得狂热，所以就有了夜雨吧。\n' +
//    			'为躁动添一种和谐，不让这一季显得枯燥，这是雨的本意，' +
//    			'也是季节的恩惠。\n从雨滴落过的地方找寻，会发现斑斑点点的痕迹，痕迹多了，就凸出新意了。油纸伞，因出现在雨巷，故而痴想。叶儿，因拂去了微尘，方绿意蒙蒙。世界，因除去了浮垢，才焕然一新。雨过，天晴。花瓣上的水滴，随着风儿滚动着，滑落着，然后，变成了水印。透过树林的空隙，点点阳光洒在上面，一眨眼，水印就变了一种颜色。这是一种影印，一种蜕变，也是感受来的小巷落雨的味道。人的感觉有时候会很滑稽，很可笑，思维也会很奇特，很微妙。看到油纸伞，就会想到雨巷；看到一滴水的滚动与滑落，会想到一粒沙子里面的那个世界；看到一片花瓣的呼吸，会想到一座市井的环境；这一切，似乎都与那一句“多愁善感”的个性和命运结合上了。眼看着最美的五月姗姗而去，品茗着小巷落雨，心中陡然升起一种淡淡的酸楚。念及五月的情思，五月的神美，五月的天韵，五月的气色，五月的佳境，整个身心会感到一阵的疲惫。是啊，这种酸楚是被青春抛弃的无奈，这种疲惫是被岁月洗尽铅华的不舍！每一天从小巷里行进行出，不经意间，年轮已悄悄地为我们的脸上涂上了淡淡的岁月印迹，增添了流年的风霜。小巷落雨，把五月隔在了窗里，把六月关在了窗外，在这一里一外之间，仿佛所有的过往顷刻间烟消云散，那一种淡淡的酸楚也随风“归零”，整个仿佛一下子落得清静、安逸。人，本身就是矛盾的组合体。偶尔产生从泥土中来，还要复归到泥土中去的想法，也是人之常情。在上帝的手中，人其一生，所有辉煌和惨淡终将不声不响地重归于零。';
    }
    public void showlog(String msg){
    	Log.i("chenghao", msg);
    }
}
